brianwyld/ble_nrf51_light/src/main.c
    manuf_specific_data.data.p_data = (uint8_t *) (&_ctx.m_beacon_info[0]);
    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;
 
    // Build advertising data struct to pass into @ref ble_advertising_init.
    if (cfg_isIBeaconning()) {
        // Only make our advert look like an ibeacon if we are wanting it to be one
        advdata.name_type             = BLE_ADVDATA_NO_NAME;
        advdata.p_manuf_specific_data = &manuf_specific_data;
    } else {
        advdata.name_type             = BLE_ADVDATA_FULL_NAME;
        // And no addition manuf data so it doesn't look like an ibeacon
    }

    // depending on if we accept connections or not, advert data is different
    if (cfg_getConnectable()) {
        advdata.flags                 = (BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE |
                                        BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
        scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
        scanrsp.uuids_complete.p_uuids  = m_adv_uuids;
    } else {
        advdata.flags                 = (BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
        // Not connectable, no uuids advertised to avoid access to NUS
        scanrsp.uuids_complete.uuid_cnt = 0;
        scanrsp.uuids_complete.p_uuids  = NULL;
    }
    scanrsp.name_type = BLE_ADVDATA_FULL_NAME;
    scanrsp.short_name_len = 8;      // get at least id part (maj/min in hex)
    scanrsp.p_tx_power_level = &txPowerLevel;

    // Give both options for advert speed (the one used depends on whether isIBeaconning() is true or not)
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS);
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
    options.ble_adv_slow_enabled = true;
    options.ble_adv_slow_interval = MSEC_TO_UNITS(APP_ADV_INTERVAL_MS_SLOW, UNIT_0_625_MS);     //1285*1.6;
    options.ble_adv_slow_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
 
//    err_code = ble_advdata_set(&advdata, NULL); Done in ble_advertising_init using advdata
//    APP_ERROR_CHECK(err_code);
    // TODO : using ble_advertising module means out ibeacons are always flagged as connectable 
    // (never sets type to BLE_GAP_ADV_TYPE_ADV_NONCONN_IND)
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}
 
 

static bool advertising_check_start()
{
    uint32_t err_code;
    // Can't start if currently got an active BLE connection (not enough channels)
    if (_ctx.m_conn_handle!=BLE_CONN_HANDLE_INVALID) {
        return false;
    }
    // in all cases, setup to be ready otherwise the ble_advertisting_start() will fail with wrong state error
    ble_gap_conn_sec_mode_t sec_mode;    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // password check has not been validated
    cfg_resetPasswordOk();
    // Change name
    sd_ble_gap_device_name_set(&sec_mode,
                            (const uint8_t *)(cfg_getAdvName()),
                                strlen(cfg_getAdvName()));

    // Change tx power level
    sd_ble_gap_tx_power_set(cfg_getTXPOWER_Level());

    advertising_setup();
    // only advertise if we want to be connectable, or we are ibeaconning, and we are NOT scanning
    if ((cfg_getConnectable() || ibb_isBeaconning())) // && ibs_is_scan_active()==false)
    {
        err_code = ble_advertising_start(ibb_isBeaconning()?BLE_ADV_MODE_FAST:BLE_ADV_EVT_SLOW);
        APP_ERROR_CHECK(err_code);
        log_info("adv check : connectable [%s] beaconning : %s", cfg_getAdvName(), ibb_isBeaconning()?"yes":"no");
        return true;
    } else {
        //idle the adverts
        err_code = ble_advertising_start(BLE_ADV_MODE_IDLE);
        APP_ERROR_CHECK(err_code);
        sd_ble_gap_adv_stop();
        log_info("adv check: no beaconning");
        return false;
    }
}
 


/** @brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


 
/*
static void deinit_uart_timeout_handler(void * p_context)
{
    comm_uart_deinit();
    
    //
    //examples to setup TX/RX in different mode :
    //
    //nrf_gpio_cfg_default(RX_PIN_NUMBER);
    //nrf_gpio_cfg_default(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_output(RX_PIN_NUMBER);
    //nrf_gpio_pin_set(RX_PIN_NUMBER);
    //nrf_gpio_cfg_output(TX_PIN_NUMBER);
    //nrf_gpio_pin_set(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_input(RX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
    //nrf_gpio_cfg_input(TX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
}
*/


// Control of beaconning activity
bool ibb_isBeaconning() {
    return (cfg_isIBeaconning());
}

void ibb_start() {
    cfg_setIsIBeaconning(true);
    // To change the beaconning, we have to stop anything currently running (connectable or ibeaconning)
    // TODO (the current phase will timeout in a while anyway and then we'll re-check it)
}
void ibb_stop() {
    cfg_setIsIBeaconning(false);
    // To change the beaconning, we have to stop anything currently running (connectable or ibeaconning)
    // TODO (the current phase will timeout in a while anyway and then we'll re-check it)
}

/** request a reset asap */
void app_reset_request() {
    _ctx.resetRequested = true;    
}

void app_setFlashBusy() {
    _ctx.flashBusy = true;      // someone somewhere is writing to the flash
}
bool app_isFlashBusy() {
    return _ctx.flashBusy;      // they would like to know if its busy right now
}

int main(void)
{
    system_init();

    // Setup gpio
    uint32_t err_code;
    if(!nrf_drv_gpiote_is_init())
    {
        err_code = nrf_drv_gpiote_init();
    }
    // Init uart asap in case using for logs also
    comm_uart_init(); 

#ifdef RELEASE_BUILD
    wlog_init(-1);      // replace by 0 to get logs on uart
#else 
    wlog_init(0);      // replace by 0 to get logs on uart - warning will disrupt remote guy if connected..
#endif
    cfg_init();              
   log_info("config/log init done");
    
    ble_init();
    log_info("ble system init done");

    lightctl_init();
    // Tell host we are ready to rock
    comm_uart_tx((uint8_t *)"+READY\r\n",8, NULL);
    // Init adv parameters and start if required
    advertising_check_start();

    //todo remove uart disabled at 10s of ibeaconning for power
    /*                    
    app_timer_create(&m_deinit_uart_delay,
                        APP_TIMER_MODE_SINGLE_SHOT,
                        deinit_uart_timeout_handler);    
        uint32_t deinit_delay = APP_TIMER_TICKS(10000, APP_TIMER_PRESCALER);//32 * 10000;          
        app_timer_start(m_deinit_uart_delay, deinit_delay, NULL);
    */
   lightctl_start();
   log_info("waiting for commands");
    for (;;)
    {        
        if (_ctx.resetRequested)
        {
            NVIC_SystemReset();
        }
        // Check if flash needs updating
        cfg_writeCheck();
        // Check if UART has data to process
        comm_uart_processRX();
        // Go in lowpower only if flash isn't busy
        if(!app_isFlashBusy())
        {
            power_manage();
        }
    }
}
